Revit 2025 API
PanelScheduleType Enumeration
 This enum declares the panel schedule type.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum PanelScheduleType
Public Enumeration PanelScheduleType
public enum class PanelScheduleType
type PanelScheduleType
Members
Member name | Value | Description
Branch | 0 |  Branch panel schedule
Switchboard | 1 |  Switchboard schedule
Data | 2 |  Data panel schedule
Unknown | -1 |  Unknown panel schedule
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace